Revit 2024 API
PartUtils.HasAssociatedParts Method
Overload List
Name | Description
HasAssociatedParts(Document, ElementId)
 Checks if an element has associated parts.
HasAssociatedParts(Document, LinkElementId)
 Checks if an element has associated parts.
See Also
PartUtils Class
PartUtils Members
Autodesk.Revit.DB Namespace